Redesign WEXA submission README
